#include <iostream>

/*
0. Рендер
  - Линии толщиной "1 шмиксель"
  - Линии могут иметь толщину
  - Сглаживание
1. Создавать разные фигуры
  - Пример: отрезок
    - С координатами
    - Отрезок между другими фигурами
  - Пример: окружность
    - Соосные окружности
    - Касательная к окружности
2. Камера: отображать разные части СК
  - Камера по умолчанию
  - Камера в заданной позиции
  - Камера, привязанная к фигуре
  - Создать / удалить / добавить / поменять
  - Объединение камер
3. Операции с фигурами
  - Подвинуть "на"
  - Переместить "в"
  - Поворот
  - Рисование кривых / косых линий
  - Комбинировать
  - Слои и разные символы рызных слоёв
  - Операции со слоями(пересечение, вычитание, объединение)
4. Сохранить / загрузить "рабочую область"
  - Открыть
  - Закрыть
  - Удалить
  - Состояние проекта
5. Мета-команды
  - Хелп / описание
  - Макросы (без параметров)
  - Макросы (с параметрами)
  - Макросы (с именованными параметрами)
  - Чтение команд из файла
  - Сохранение макросов / загрузка макросов
6. Цветные глифы / фон
7. Экспорт в SVG / PNG
8. Импорт из PNG
9. Отрисовка текста (разного размера)
*/

int main()
{}
